---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Application..::..OpenIFCDocument Method
Application Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | OpenIFCDocument(String) | Opens an IFC document from disk using default options. |
|  | OpenIFCDocument(String, IFCImportOptions) | Opens an IFC document from disk using custom options. |

# See Also

Application Class

Application Members

Autodesk.Revit.ApplicationServices Namespace